<?php
// Heading
$_['heading_title_requirement']                    = 'Сервер не соответствует требованиям OpenCart!';
$_['heading_title_warning']                        = 'Внимание!';

// Text
$_['text_success_install']                         = 'Дополнение успешно установлено.';
$_['text_success_update']                          = 'Некоторые дополнения успешно обновлены.';
$_['text_debug']                                   = 'Отладочная информация сохранена в файл %s.';

// Error
$_['error_modification']                           = 'Некоторые дополнения от разработчиков ocmodify.com обновлены! Пожалуйста, обновите кэш модификаторов (Меню админки -> Дополнения -> Модификаторы -> [обновить]).';
$_['error_permission']                             = 'Вы не имеете права выполнять данную операцию.';
$_['error_requirement_mbstring']                   = 'Предупреждение: расширение mbstring требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_curl']                       = 'Предупреждение: расширение curl требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_mcrypt']                     = 'Предупреждение: расширение mcrypt требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_zip']                        = 'Предупреждение: расширение zip требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_vqmod']                      = 'Предупреждение: Для данной версии OpenCart требуется vqmod.';
$_['error_requirement_vqmod_version']              = 'Предупреждение: Установлена несовместимая версия vqmod. Пожалуйста, установите последнюю версию vqmod.';