<?php
// Heading
$_['heading_title_warning']                        = 'Внимание!';

// Tab
$_['tab_documentation']                            = 'Документация';
$_['tab_support']                                  = 'Поддержка';

// Text
$_['text_analytics']                               = 'Аналитика';
$_['text_captcha']                                 = 'Каптча';
$_['text_dashboard']                               = 'Модули главной панели';
$_['text_feed']                                    = 'Каналы продвижения';
$_['text_fraud']                                   = 'Защита от мошенников';
$_['text_module']                                  = 'Модули';
$_['text_payment']                                 = 'Модули оплаты';
$_['text_shipping']                                = 'Модули доставки';
$_['text_theme']                                   = 'Темы';
$_['text_total']                                   = 'Итоги';
$_['text_success']                                 = 'Настройки успешно обновлены.';
$_['text_success_install']                         = 'Дополнение успешно установлено.';
$_['text_success_update']                          = 'Некоторые дополнения успешно обновлены.';
$_['text_confirm']                                 = 'Вы действительно хотите выполнить данную операцию?';
$_['text_loading']                                 = 'Идет загрузка...';
$_['text_debug']                                   = 'Отладочная информация сохранена в файл %s.';

// Error
$_['error_modification']                           = 'Некоторые дополнения от разработчиков ocmodify.com обновлены! Пожалуйста, обновите кэш модификаторов (Меню админки -> Дополнения -> Модификаторы -> [обновить]).';
$_['error_permission']                             = 'Вы не имеете права выполнять данную операцию.';
$_['error_requirement_mbstring']                   = 'Предупреждение: расширение mbstring требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_curl']                       = 'Предупреждение: расширение curl требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_mcrypt']                     = 'Предупреждение: расширение mcrypt требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_zip']                        = 'Предупреждение: расширение zip требуется для корректной работы модулей. Пожалуйста, включите его в настройках php.';
$_['error_requirement_vqmod']                      = 'Предупреждение: Для данной версии OpenCart требуется vqmod.';
$_['error_requirement_vqmod_version']              = 'Предупреждение: Установлена устаревшая версия vqmod. Пожалуйста, установите последнюю версию vqmod.';
$_['error_chmod_dir']                              = 'Предупреждение: Нет доступа к записи к папке "%s", пожалуйста, откройте доступ к записи к этой папке. Иначе, расширение может некорректно работать.';
$_['error_chmod_file']                             = 'Предупреждение: Нет доступа к записи к файлу "%s", пожалуйста, откройте доступ к записи к этому файлу. Иначе, расширение может некорректно работать.';
$_['error_undefined']                              = 'Неизвестная ошибка...';

// JS Text
$_['javascript']['text_select_all']                = 'Все';
$_['javascript']['text_unselect_all']              = 'Ничего';
$_['javascript']['text_none']                      = '-- Не выбрано ничего --';
$_['javascript']['text_confirm']                   = 'Вы действительно хотите выполнить данную операцию?';
$_['javascript']['text_confirmation']              = 'Подтверждение оперции';
$_['javascript']['text_loading']                   = 'Идет загрузка...';
$_['javascript']['text_wait']                      = 'Идет загрузка, пожалуйста, дождитесь загрузки страницы...';
$_['javascript']['text_done']                      = 'Готово!';

// JS Error
$_['javascript']['error_loading']                  = 'Пожалуйста, дождитесь загрузки страницы...';
$_['javascript']['error_undefined']                = 'Ooops, что то пошло не так...';