<?php
/**
 * @author    p0v1n0m <p0v1n0m@gmail.com>
 * @license   Commercial
 * @link      https://github.com/p0v1n0m
 */
// Heading
$_['heading_title']             = '</> Доставка «Grastin»';
$_['heading_license']           = 'Активация модуля';

// Button
$_['button_total']              = 'Учет в заказе';
$_['button_export']             = 'Настройки экспорта';
$_['button_order']              = 'Заказы';
$_['button_apply']              = 'Применить';

// Tab
$_['tab_setting']               = 'Настройки';
$_['tab_api']                   = 'API';
$_['tab_delivery']              = 'Варианты';
$_['tab_map']                   = 'Карта';
$_['tab_cap']                   = 'Заглушка';
$_['tab_support']               = 'Поддержка';

// Text
$_['text_extension']            = 'Доставки';
$_['text_success']              = 'Настройки успешно изменены!';
$_['text_developer']            = 'Разработчик';
$_['text_site']                 = 'Сайт';
$_['text_module_docs']          = 'Документация';
$_['text_delivery']             = 'Сайт доставки';
$_['text_api_docs']             = 'Документация API';
$_['text_kg']                   = 'кг';
$_['text_sm']                   = 'см';
$_['text_rub']                  = 'руб';
$_['text_dni']                  = 'д.';
$_['text_pcs']                  = 'шт.';
$_['text_volume']               = 'По объему';
$_['text_width']                = 'По ширине';
$_['text_length']               = 'По длине';
$_['text_height']               = 'По высоте';
$_['text_courier_grastin']      = 'Курьер Grastin';
$_['text_courier_boxberry']     = 'Курьер Boxberry';
$_['text_pickup_grastin']       = 'Самовывоз Grastin';
$_['text_pickup_boxberry']      = 'Самовывоз Boxberry';
$_['text_pickup_hermes']        = 'Самовывоз Hermes';
$_['text_pickup_partner']       = 'Партнерский самовывоз';
$_['text_pickup_post']          = 'Почта России';
$_['text_logo']                 = 'логотип службы доставки';
$_['text_name']                 = 'название выбранного ПВЗ';
$_['text_desc']                 = 'описание выбранного ПВЗ';
$_['text_days']                 = 'срок доставки';
$_['text_percent_order']        = '% от стоимости заказа';
$_['text_percent_shipping']     = '% от стоимости доставки';
$_['text_map_overall']          = 'Общий';
$_['text_map_individual']       = 'Индивидуальный';
$_['text_geolocationControl']   = 'Геолокация';
$_['text_searchControl']        = 'Поиск по карте';
$_['text_routeButtonControl']   = 'Панель маршрутизации';
$_['text_trafficControl']       = 'Пробки';
$_['text_typeSelector']         = 'Переключатель слоев карты';
$_['text_fullscreenControl']    = 'Полноэкранный режим';
$_['text_zoomControl']          = 'Ползунок масштаба';
$_['text_rulerControl']         = 'Линейка';
$_['text_license']              = 'Для запроса лицензии напишите на контактный email с указанием:<br>1. Места покупки<br>2. Номера заказа<br>3. Рабочего (тестового) домена<br>4. Версии движка';

// Entry
$_['entry_title']               = 'Заголовок';
$_['entry_sort_order']          = 'Сортировка';
$_['entry_weight_class']        = 'Единицы измерения веса';
$_['entry_default_weight']      = 'Вес по умолчанию';
$_['entry_length_class']        = 'Единицы измерения длины';
$_['entry_default_dimension']   = 'Размеры по умолчанию';
$_['entry_default_length']      = 'Длина';
$_['entry_default_width']       = 'Ширина';
$_['entry_default_height']      = 'Высота';
$_['entry_calc_type']           = 'Вариант расчета габаритов';
$_['entry_weight']              = 'Вес заказа';
$_['entry_min_weight']          = 'Минимальный вес заказа';
$_['entry_max_weight']          = 'Максимальный вес заказа';
$_['entry_total']               = 'Стоимость заказа';
$_['entry_min_total']           = 'Минимальная стоимость заказа';
$_['entry_max_total']           = 'Максимальная стоимость заказа';
$_['entry_tax_class']           = 'Налоговый класс';
$_['entry_geo_zone']            = 'Геозона';
$_['entry_status']              = 'Статус';
$_['entry_api_key']             = 'Ключ API';
$_['entry_logging']             = 'Логирование';
$_['entry_cache']               = 'Кэширование';
$_['entry_list']                = 'Список ПВЗ';
$_['entry_quote_title']         = 'Заголовок';
$_['entry_add_day']             = 'Добавить к сроку доставки';
$_['entry_shipping_cost']       = 'Стоимость доставки';
$_['entry_order_cost']          = 'Стоимость заказа';
$_['entry_cap_cost']            = 'Стоимость';
$_['entry_city']                = 'Город';
$_['entry_value']               = 'Значение';
$_['entry_only_total']          = 'Только в Итого';
$_['entry_code']                = 'Код варианта доставки';
$_['entry_map_key']             = 'Ключ Яндекс API';
$_['entry_map_type']            = 'Режим карты';
$_['entry_map_filter']          = 'Первичный фильтр вариантов';
$_['entry_map_controls']        = 'Элементы управления';
$_['entry_license']             = 'Ключ лицензии';

// Help
$_['help_title']                = 'Общий заголовок метода доставки на странице оформления заказа.';
$_['help_sort_order']           = 'Порядок сортировки метода доставки в общем списке методов на странице оформления заказа.';
$_['help_weight_class_id']      = 'Необходимо выбрать <strong>Килограммы</strong>.';
$_['help_default_weight']       = 'Укажите вес <strong>одного товара</strong>, он будет использоваться при расчете общего веса заказа, если у какого-либо товара не задан вес. В качестве разделителя используется <strong>точка</strong>.';
$_['help_length_class_id']      = 'Необходимо выбрать <strong>Сантиметры</strong>.';
$_['help_default_dimension']    = 'Укажите габаритные размеры <strong>одного товара</strong>, они будут использоваться при расчете общих габаритов заказа, если у какого-либо товара они не заданы. В качестве разделителя используется <strong>точка</strong>.';
$_['help_calc_type']            = ' <br><strong>По объему: </strong>извлекается кубический корень из общего объема товаров - это будет размер стороны отправления, все стороны которого будут равны.<br><strong>По ширине: </strong>находятся максимальные размеры высоты и длины среди товаров заказа - они будут высотой и длиной отправления, а размеры ширины всех товаров заказа суммируются - это будет ширина отправления.<br><strong>По длине: </strong>находятся максимальные размеры высоты и ширины среди товаров заказа - они будут высотой и шириной отправления, а размеры длины всех товаров заказа суммируются - это будет длина отправления.<br><strong>По высоте: </strong>находятся максимальные размеры ширины и длины среди товаров заказа - они будут шириной и длиной отправления, а размеры высоты всех товаров заказа суммируются - это будет высота отправления.';
$_['help_min_weight']           = 'Вес заказа, начиная с которого метод доставки будет доступен.';
$_['help_max_weight']           = 'Вес заказа, при превышении которого метод доставки будет недоступен.';
$_['help_min_total']            = 'Стоимость заказа, начиная с которой метод доставки будет доступен.';
$_['help_max_total']            = 'Стоимость заказа, при превышении которой метод доставки будет недоступен.';
$_['help_api_key']              = 'Можно получить в личном кабинете доставки или при обращении в техподдержку.';
$_['help_logging']              = 'При включении все запросы к api логируются в журнал ошибок (Систем - Инструменты - Журнал ошибок) с префиксом <strong>[ll_grastin]</strong>. При этом, если включено кэширование, то логирование происходит только в момент перезаписи кэша, т.е. при реальном запросе к api. Типы записей: <strong>[success]</strong> - успешный запрос, <strong>[error]</strong> - запрос окончился ошибкой, <strong>[info]</strong> - информационное сообщение.';
$_['help_cache']                = 'При включении все запросы к api кэшируются, что ускоряет расчет стоимости доставки. Включайте только после полной настройки модуля.';
$_['help_variant_list']         = 'Будет отображаться выпадающий список ПВЗ.';
$_['help_variant_sort_order']   = 'Порядок сортировки данного варианта доставки среди других вариантов.';
$_['help_variant_quote_title']  = 'В шаблоне названия можно использовать динамические переменные, которые будут заменены соответствующими значениями:';
$_['help_variant_add_day']      = 'Указанное число будет добавлено к сроку доставки данного варианта.';
$_['help_variant_cost_cost']    = 'Условие, при котором будет работать модификация стоимости доставки.';
$_['help_variant_cost_city']    = 'Можно указать несколько городов, через запятую, обязательно <strong>в нижнем регистре</strong>.';
$_['help_variant_cost_mod']     = 'Скидка ( - ), наценка ( + ) или фиксированная сумма ( = ), которая модифицирует стоимость доставки.';
$_['help_variant_cost_total']   = 'При включении, модификация стоимости доставки будет работать только в <strong>Итого</strong>.<br>Если при этом включен дополнительный модуль "Учитывать в заказе", то модификация цены будет происходить через него.';
$_['help_variant_cost_example'] = 'Примеры:<br>Бесплатная доставка для заказов от 500р - [500] [=] [0] [руб]<br>50% скидка на доставку для заказов стоимостью от 333р - [333] [-] [50] [% от стоимости доставки]<br>30% наценка стоимости доставки всем заказам (если стоимость доставки 200р, а должна стать 300р) - [0] [+] [30] [% от стоимости доставки]';
$_['help_variant_code']         = 'Неизменный код данного варианта доставки, может использоваться, например, в Simple.';
$_['help_map_key']              = 'Если ключ разработчика перестал работать (карта не отображается), зарегистрируйте свой ключ по ссылке: <a href="https://developer.tech.yandex.ru/keys/" target="_blank">https://developer.tech.yandex.ru/keys/</a>. Для карты со стандартными элементами управления все запросы к api яндекса полностью бесплатны и безлимитны.';
$_['help_map_type']             = 'В общем режиме отображается одна кнопка изменения ПВЗ под общим заголовком. В индивидуальном режиме для каждого метода самовывоза отображается своя кнопка изменения ПВЗ, а при открытии карты ПВЗ будут отфильтрованы согласно выбранному методу. В <strong>Simple</strong> для отображения карты необходимо включить <strong>отображение заголовков модулей доставки</strong> в настройках блока "Доставка", т.к. карта выводится вместе с заголовком.';
$_['help_map_filter']           = 'В <strong>индивидуальном режиме</strong> карты, при ее открытии, сразу будет выбран соответствующий вариант доставки.';
$_['help_map_control']          = 'Описание элементов управления картой: <a href="https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/controls/standard-docpage/" target="_blank">https://tech.yandex.ru/maps/doc/jsapi/2.1/dg/concepts/controls/standard-docpage/</a>';

// Error
$_['error_permission']          = 'У вас нет прав для изменения модуля!';
$_['error_license']             = 'Неверный ключ лицензии!';
